Autodesk.Revit.DB.DigitGroupingSymbol
Since:
2014
The symbol used to separate groups of digits when numbers are formatted with digit grouping.
Since:
2014

Autodesk.Revit.DB.DigitGroupingSymbol.Tick
An apostrophe ("'").  This value is deprecated in Revit 2015.  Use DigitGroupingSymbol.Apostrophe instead.

Autodesk.Revit.DB.DigitGroupingSymbol.Apostrophe
An apostrophe ("'").

Autodesk.Revit.DB.DigitGroupingSymbol.Space
A space (" ").

Autodesk.Revit.DB.DigitGroupingSymbol.Comma
A comma (",").

Autodesk.Revit.DB.DigitGroupingSymbol.Dot
A dot (".").